In [1]:
import numpy as np
import pandas as pd
import matplotlib

In [7]:
# Series

list1 = [4,3,6,8,7]
s1 = pd.Series(list1)
# s1 = pd.Series(list1, index =['a','b','c','d','e'])
print('s1 : \n', s1)
type(s1)
s1.dtype
s1.values
s1.index=['a','b','c','d','e']
# s1.index

s1 :
 0    4
1    3
2    6
3    8
4    7
dtype: int64

In [8]:
sdata={'kim' : 80, 'lee':85, 'choi':85}
s2 = pd.Series(sdata)
s2

kim     80
lee     85
choi    85
dtype: int64

In [11]:
# DataFrame

# DataFrame : 생성
# 형식: pd.DataFrame(data, columns=[], index=[])

# dictionary 데이터 활용
data = {'names':['민준', '현우', '서연', '동현', '지현'],
        'years':[2013, 2014, 2015, 2016, 2015],
        'points':[1.5, 1.7, 3.6, 2.4, 2.9]
        }
df = pd.DataFrame(data)

# print(df)와 df 출력방식이 서로 다름
print(df)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

In [13]:
names=['민준', '현우', '서연', '동현', '지현']
years=[2013, 2014, 2015, 2016, 2015]
points=[1.5, 1.7, 3.6, 2.4, 2.9]
data1 = [names, years, points]
data1
# -> 데이터가 3행 5열로 나옴 -> T(transpose)를 사용하여 행/열 반전시킴

[['민준', '현우', '서연', '동현', '지현'],
 [2013, 2014, 2015, 2016, 2015],
 [1.5, 1.7, 3.6, 2.4, 2.9]]

In [17]:
# 2차원 배열 데이터 활용
data2 = [['민준', '현우', '서연', '동현', '지현'],
         [2013, 2014, 2015, 2016, 2015],
         [1.5, 1.7, 3.6, 2.4, 2.9]]
arr = np.array(data2).T
df1 = pd.DataFrame(arr)
df1.columns=['name', 'year', 'point']
df1.index=[1,2,3,4,5]
# df1 = pd.DataFrame(arr, columns=['name', 'year', 'point'], index=[1,2,3,4,5])
df1

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9

In [24]:
print(df1)
print(df1.index)
print(df.index)
print(df1.values)
print(df1.columns)

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9
Index([1, 2, 3, 4, 5], dtype='int64')
RangeIndex(start=0, stop=5, step=1)
[['민준' '2013' '1.5']
 ['현우' '2014' '1.7']
 ['서연' '2015' '3.6']
 ['동현' '2016' '2.4']
 ['지현' '2015' '2.9']]
Index(['name', 'year', 'point'], dtype='object')

In [27]:
df1.info()
# array로 만든 후 dataframe을 만들었기 때문에 dtype이 전부  object로 나옴
# array는 한가지 데이터 타입만 들어갈 수 있다

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      int64
 2   points  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [45]:
# chocolate_rating.csv 가져오기
choco_df = pd.read_csv("data/chocolate_rating.csv", header=None)
# header=None : 헤더가 따로 없을 때 없다고 해줘야 함
# -> 아니면 1행이 헤더가 됨
df3 = choco_df.head() # 맨 위의 5개만
df4 = choco_df.tail() # 맨 아래의 5개만
df3.to_csv("data/df3.csv", index=False)
df4.to_csv("data/df4.csv", index=False)
# index=False : 저장할 때 인덱스는 저장 안 되도록

In [37]:
charac_df = pd.read_excel("data/characters.xlsx")
charac_df.to_excel("data/dftest.xlsx", index=False)
charac_df

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [39]:
charac_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [38]:
charac_df2 = pd.read_excel("data/dftest.xlsx")
charac_df2

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [40]:
charac_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [46]:
choco_df

         0     1     2     3
0        1  2016  0.63  3.75
1        2  2015  0.70  2.75
2        3  2015  0.70  3.00
3        4  2015  0.70  3.50
4        5  2015  0.70  3.50
...    ...   ...   ...   ...
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

[1795 rows x 4 columns]

In [47]:
# DataFrame : 조회

# choco_df columns 지정해주기
choco_df.columns=['번호', '연도', '함유량', '평점']
choco_df

        번호    연도   함유량    평점
0        1  2016  0.63  3.75
1        2  2015  0.70  2.75
2        3  2015  0.70  3.00
3        4  2015  0.70  3.50
4        5  2015  0.70  3.50
...    ...   ...   ...   ...
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

[1795 rows x 4 columns]

In [48]:
# DataFrame 정보 보기

choco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      1795 non-null   int64
 1   연도      1795 non-null   int64
 2   함유량     1795 non-null   float64
 3   평점      1795 non-null   float64
dtypes: float64(2), int64(2)
memory usage: 56.2 KB

In [50]:
# 데이터 보기

# head() : 앞부분 데이터 5개 보기
print(choco_df.head())
# tail() : 뒷부분 데이터 5개 보기
print(choco_df.tail())

   번호    연도   함유량    평점
0   1  2016  0.63  3.75
1   2  2015  0.70  2.75
2   3  2015  0.70  3.00
3   4  2015  0.70  3.50
4   5  2015  0.70  3.50
        번호    연도   함유량    평점
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

In [51]:
# 인덱스 0~9까지 데이터 보기
print(choco_df[:10])
# 인덱스 10~19까지 데이터 보기
print(choco_df[10:20])

   번호    연도   함유량    평점
0   1  2016  0.63  3.75
1   2  2015  0.70  2.75
2   3  2015  0.70  3.00
3   4  2015  0.70  3.50
4   5  2015  0.70  3.50
5   6  2014  0.70  2.75
6   7  2014  0.70  3.50
7   8  2014  0.70  3.50
8   9  2014  0.70  3.75
9  10  2014  0.70  4.00
    번호    연도  함유량    평점
10  11  2013  0.7  2.75
11  12  2013  0.7  3.00
12  13  2013  0.7  3.25
13  14  2013  0.7  3.75
14  15  2013  0.7  2.75
15  16  2013  0.7  3.00
16  17  2013  0.7  3.25
17  18  2013  0.7  4.00
18  19  2013  0.7  3.25
19  20  2013  0.7  3.50

In [52]:
# 열 이름, 인덱스 조회

# 열 이름 조회
print(choco_df.columns)

# index
print(choco_df.index)

Index(['번호', '연도', '함유량', '평점'], dtype='object')
RangeIndex(start=0, stop=1795, step=1)

In [53]:
# describe() 함수 : 데이터 요약 정보를 보여줌

choco_df.describe()

                번호           연도          함유량           평점
count  1795.000000  1795.000000  1795.000000  1795.000000
mean    898.000000  2012.325348     0.717003     3.185933
std     518.316184     2.927210     0.063230     0.478062
min       1.000000  2006.000000     0.420000     1.000000
25%     449.500000  2010.000000     0.700000     2.875000
50%     898.000000  2013.000000     0.700000     3.250000
75%    1346.500000  2015.000000     0.750000     3.500000
max    1795.000000  2017.000000     1.000000     5.000000

In [62]:
# 인덱스 기준 정렬
# ascending : True(오름차순), False(내림차순)
df1.sort_index(axis=0, ascending=True)

# 열 기준 정렬
df1.sort_values(by=['point'], ascending=False)

  name  year point
3   서연  2015   3.6
5   지현  2015   2.9
4   동현  2016   2.4
2   현우  2014   1.7
1   민준  2013   1.5